Revit 2024 API
IFCTransaction.RollBack Method
 Rolls back all changes made to the IFC file during the transaction.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void RollBack()
Visual Basic
Public Sub RollBack
Visual C++
public:
void RollBack()
See Also
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace